SunCity/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоРаспознавания</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>ОблачнаяККТ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьWebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ВидТранспортаОфлайнОбмена</name>
    <type>
      <types>EnumRef.ВидыТранспортаОфлайнОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWebСервисОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособФорматноЛогическогоКонтроля</name>
    <type>
      <types>EnumRef.СпособыФорматноЛогическогоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОфлайнОборудования</name>
    <type>
      <types>EnumRef.ТипыОфлайнОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяУстановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияФорматаОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПризнакСпособаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПризнакПредметаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяФискализация</name>
    <comment>Автоматическая фискализация чеков из очереди чеков</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФН36</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованием</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринтерПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьЦенникиВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>НаименованиеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonForms/ФормаНастройкиWebkassaФискальныеРегистраторы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	
	Заголовок = НСтр("ru='Оборудование:'") + Символы.НПП  + Строка(Идентификатор);
	
	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

	времАвтоматическаяПечатьЧека  = Неопределено;
	времШиринаЛенты               = Неопределено;
	ЯзыкПоУмолчанию               = Неопределено;
	времИспользоватьПринтерЧеков  = Неопределено;
	времПринтерЧеков              = Неопределено;
	
	Параметры.ПараметрыОборудования.Свойство("АвтоматическаяПечатьЧека", времАвтоматическаяПечатьЧека);
	Параметры.ПараметрыОборудования.Свойство("ШиринаЛенты"             , времШиринаЛенты);
	Параметры.ПараметрыОборудования.Свойство("ЯзыкПоУмолчанию"             , ЯзыкПоУмолчанию);
	Параметры.ПараметрыОборудования.Свойство("ИспользоватьПринтерЧеков", времИспользоватьПринтерЧеков);
	Параметры.ПараметрыОборудования.Свойство("ПринтерЧеков"            , времПринтерЧеков);
	
	АвтоматическаяПечатьЧека = ?(времАвтоматическаяПечатьЧека  = Неопределено, Ложь, времАвтоматическаяПечатьЧека);
	ИспользоватьПринтерЧеков = ?(времИспользоватьПринтерЧеков  = Неопределено, Ложь, времИспользоватьПринтерЧеков);
	ПринтерЧеков             = ?(времПринтерЧеков              = Неопределено, Справочники.ПодключаемоеОборудование.ПустаяСсылка(), времПринтерЧеков);
	ШиринаЛенты = ?(времШиринаЛенты = Неопределено, "24", времШиринаЛенты);
	ШиринаЛенты = ?(АвтоматическаяПечатьЧека, ШиринаЛенты, "24");
	
	Элементы.ШиринаЛенты.СписокВыбора.Добавить("24");
	Элементы.ШиринаЛенты.СписокВыбора.Добавить("32");
	Элементы.ШиринаЛенты.СписокВыбора.Добавить("36");
	Элементы.ШиринаЛенты.СписокВыбора.Добавить("40");
	Элементы.ШиринаЛенты.СписокВыбора.Добавить("48");
	
	Элементы.ШиринаЛенты.Доступность = АвтоматическаяПечатьЧека;
	Элементы.ЯзыкПоУмолчанию.Доступность = АвтоматическаяПечатьЧека;
	Элементы.ГруппаПараметровПечати.Доступность = АвтоматическаяПечатьЧека;
	Элементы.ПринтерЧеков.Доступность = ИспользоватьПринтерЧеков;
	
	Элементы.ТестУстройства.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	Элементы.ТестКомпоненты.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	
	//принтер чеков
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ТипОборудования", Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков));
	Элементы.ПринтерЧеков.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	Если НЕ АвтоматическаяПечатьЧека Тогда
		ШиринаЛенты = "";
		ЯзыкПоУмолчанию = Неопределено;
	КонецЕсли;
	
	Закрыть(ПолучитьНастройки());
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	
	ОчиститьСообщения();
	
	РезультатТеста = Неопределено;
	ДемонстрационныйРежим = "";
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	ЭтаФорма.КоманднаяПанель.Доступность = Ложь;
	
	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	ПараметрыУстройства = ПолучитьНастройки().ПараметрыОборудования;
	ПараметрыУстройства.Вставить("Идентификатор", Идентификатор);
	
	Оповещение = Новый ОписаниеОповещения("ТестУстройстваЗавершение", ЭтотОбъект);
	ИнтеграцияWebKassaКлиентПереопределяемый.НачатьВыполнениеДополнительнойКоманды(Оповещение, "CheckHealth", ВходныеПараметры, Идентификатор, ПараметрыУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройстваЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	ЭтаФорма.КоманднаяПанель.Доступность = Истина;
	
	ДополнительноеОписание = "";
	ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
	
	Если ТипЗнч(ВыходныеПараметры) = Тип("Массив") Тогда
		
		Если ВыходныеПараметры.Количество() >= 2 Тогда
			ДополнительноеОписание = ВыходныеПараметры[1];
		КонецЕсли;
		
	КонецЕсли;
		
	ТекстСообщения = ?(РезультатВыполнения.Результат,  НСтр("ru = 'Тест успешно выполнен. %ДополнительноеОписание%'"),
	                               НСтр("ru = 'Тест не пройден. %ДополнительноеОписание%'"));
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание), "", ДополнительноеОписание));
	ИнтеграцияWebKassaКлиентПереопределяемый.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АвтоматическаяПечатьЧекаПриИзменении(Элемент)
	Элементы.ШиринаЛенты.Доступность = АвтоматическаяПечатьЧека;
	Элементы.ЯзыкПоУмолчанию.Доступность = АвтоматическаяПечатьЧека;
	Элементы.ГруппаПараметровПечати.Доступность = АвтоматическаяПечатьЧека;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПринтерЧековПриИзменении(Элемент)
	Элементы.ПринтерЧеков.Доступность = ИспользоватьПринтерЧеков;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройки()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("АвтоматическаяПечатьЧека", АвтоматическаяПечатьЧека);
	НовыеЗначениеПараметров.Вставить("ШиринаЛенты"             , ШиринаЛенты);
	НовыеЗначениеПараметров.Вставить("ЯзыкПоУмолчанию"         , ЯзыкПоУмолчанию);
	//принтеры чеков
	НовыеЗначениеПараметров.Вставить("ПринтерЧеков"            , ПринтерЧеков);
	НовыеЗначениеПараметров.Вставить("ИспользоватьПринтерЧеков", ИспользоватьПринтерЧеков);
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТестКомпоненты(Команда)
	
	Результат = ТестКомпонентыНаСервере();
	ТекстСообщения = ?(Результат,  НСтр("ru = 'Тест внешней компоненты успешно выполнен. %ДополнительноеОписание%'"),
	                               НСтр("ru = 'Тест внешней компоненты не пройден. %ДополнительноеОписание%'"));
	Если Результат Тогда
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", "");
	Иначе
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", "Подробности см. в журнале регистрации.");
	КонецЕсли;
	ИнтеграцияWebKassaКлиентПереопределяемый.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Проверка работы компоненты формирования QR кода.
//
Функция ТестКомпонентыНаСервере()
	
	Результат = Ложь;
	Попытка
		ДанныеQRКода = ИнтеграцияWebKassaВызовСервераПереопределяемый.ПолучитьQRКод("1C:Webkassa", 1, 200);
		Результат = Истина;
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
